#1. Создайте в своем домашнем каталоге подкаталог labs.
mkdir labs

#2. Запустите следующую команду, чтобы создать группу файлов, которыми необходимо распорядиться:
touch labs/lab{1,2,3,4}.{draft,final}.{txt,pdf}
ls labs/
# команда выдаст следующее:
#lab1.draft.pdf lab2.draft.pdf lab3.draft.pdf lab4.draft.pdf
#lab1.draft.txt lab2.draft.txt lab3.draft.txt lab4.draft.txt
#lab1.final.pdf lab2.final.pdf lab3.final.pdf lab4.final.pdf
#lab1.final.txt lab2.final.txt lab3.final.txt lab4.final.txt


#3. Задайте права доступа к вашему домашнему каталогу так, чтобы другие пользователи могли получить доступ к подкаталогу labs, но не могли просматривать список файлов в домашнем каталоге.
chmod 711 ~
chmod 777 ~/labs

#4. Убедитесь, что другие пользователи могут получить доступ и посмотреть список файлов в каталоге labs. Для этого попросите другого пользователя попробовать открыть ваш каталог.
ls ~b16v7412/labs

#5. Члены вашей группы должны будут помочь вам с выполнением лабораторных работ.  Создайте каталог ~/labs/draft и выдайте вашей группе права доступа к этому каталогу так, чтобы любой мог просмотреть список содержимого каталога, но только студенты вашей группы могли создать новые файлы. Переместите все обычные файлы, которые содержат слово «draft» в своем названии, в ваш вновь созданный каталог и замените группу-владельца файла на вашу группу.
mkdir ~/labs/draft
chmod 774 ~/labs/draft

#6. За итоговый вариант файлов с выполненными лабораторными работами отвечаете вы.  Создайте каталог ~/labs/final. Вы не хотите, чтобы кто-то мог изменять вашу работу, поэтому установите такие права доступа, чтобы только вы имели доступ к каталогу на запись. Вы должны иметь полный доступ к этому каталогу, а все другие студенты вашей группы должны иметь возможность просматривать файлы этого каталога.  Переместите все обычные файлы, которые содержат в своем названии слово «final», во вновь созданный каталог.
mkdir ~/labs/final
chmod 755 final
mv labs/lab*.final.* ~/labs/final
chmod 744 ~/labs/final/*

#7. Работа над первой лабораторной работой закончилась, поэтому позаботьтесь о том, чтобы вы случайно не удалили файл lab1.final.pdf и lab1.final.txt из каталога final.
chmod 555 lab1.final.pdf lab1.final.txt

#8. Вы хотите иметь место, где можно записывать свои планы по выполнению будущих работ, вы не хотите, чтобы кто-либо увидел ваши мысли. Создайте каталог ~/labs/planning, и установите такие права доступа, чтобы вы имели полный доступ, а все остальные не имели доступа вообще.
mkdir ~/labs/planning
chmod 700 ~/labs/planning

#9. Вы заинтересованы в том, чтобы получать от любых людей подсказки по выполнению работ, но вы хотели бы, чтобы этот процесс был анонимным. Создайте каталог ~/labs/submissions и установите такие прав доступа, чтобы любой человек мог создавать новые файлы, но только вы могли видеть список содержимого каталога.  Проверьте, что все работает, попросив соседа создать новый файл в вашем каталоге с именем ~/labs/submissions/suggestion.txt.
mkdir ~/labs/submissions/
chmod 422 ~/labs/submissions/

#10. На всякий случай скопируйте команду /bin/ls как файл ~/labs/ls. Поскольку вы не хотите, чтобы кто-то запустил этот исполняемый файл, удалите все права доступа на выполнение.
cp /bin/ls ~/labs/ls
chmod a-x ~/labs/ls

#11. Поскольку другие люди будут пользоваться этим каталогом, вы слегка обеспокоены по поводу новых файлов, которые вы будете создавать. Добавьте подходящую команду в конец вашего файла ~/.bashrc, так чтобы umask вашей оболочки автоматические был установлен на 077 при запуске. 
echo umask 077 > ~/.bashrc


#1. Создайте подкаталог shared в вашем домашнем каталоге. Узнайте имя пользователя вашего одногруппника, сидящего за соседним компьютером.
mkdir ~/shared

#2. Создайте файл doc1.txt в новом каталоге. Проверьте стандартные права доступа к файлу. Используя списки контроля доступа, дайте вашему соседу права на чтение созданного файла.
touch ~/shared/doc1.txt
getfacl ~/shared/doc1.txt
setfacl -m u:b16v7412:r ~/shared/doc1.txt

#3. Проверьте, что сосед может получить доступ к созданному файлу. В чем может быть причина, если ему не удалось открыть файл?
cat ~b16v7412/shared/doc1.txt

#4. Договоритесь с соседним пользователем о создании общего каталога. Настройте списки контроля доступа по умолчанию для каталога shared так, чтобы ваш сосед мог создавать новые файлы в нем и иметь права на их чтение и запись.
setfacl -m u:b16v7412:rw ~/shared

#5. Попросите соседа создать файл file1.txt и записать в него строку «This text is created by user1». Откройте созданный им файл и допишите в него вторую строку «This text is added by user2»
# сосед
echo "This text is created by user1" > ~/shared/file1.txt
# ты
echo "This text is created by user2" > ~/shared/file1.txt
cat ~/shared/file1.txt
